import 'package:flutter/material.dart';
import 'package:flutter_dev/Facebook/models/gridtravelA/travelA.dart';


class ThePlaceA extends StatefulWidget {
  @override
  _ThePlaceAState createState() => _ThePlaceAState();
}

class _ThePlaceAState extends State<ThePlaceA> {
  var theplace_list = [
    {
      "name": "วัดเจดีย์หลวง",
      "picture1": "assets/images/travelA/A3_theplace_1.jpg",
      "picture2": "assets/images/travelA/A3_theplace_2.png",
      "picture3": "assets/images/travelA/A3_theplace_3.png",
      "picture4": "assets/images/travelA/A3_theplace_4.png",
      "picture5": "assets/images/travelA/A3_theplace_5.png",
      "data": 
          "จุลศักราช 289 (พ.ศ. 1874) พญาแสนภูโปรดให้สร้างเมืองเชียงแสน และต่อมาอีก 4 ปีทรงสร้างมหาวิหารขึ้นในกลางเมืองเชียงแสน[1] คือวัดเจดีย์หลวงองค์ที่ 1 ซึ่งอยู่ในวัดพระเจ้าตนหลวง" +
          "เมืองเชียงแสน สมัยพระเจ้าแสนเมืองมาซึ่งเป็นโอรสของพญากือนา ขณะที่มีพระชนมมายุ 39 ปี พระองค์โปรดให้สร้างพระเจดีย์หลวงกลางเมืองเชียงใหม่ แต่ยังไม่ทันแล้วเสร็จดีก็สวรรคต พระราชินีผู้เป็นอัครมเหสีของพระองค์" +
          "ได้โปรดให้ทำยอดพระธาตุเจดีย์หลวงจนแล้วเสร็จ ปี พ.ศ. 2055 พระเมืองแก้ว พร้อมด้วยชาวเมืองทั้งหลาย เอาเงินมาทำกำแพงล้อมพระธาตุเจดีย์หลวง 3 ชั้นได้เงิน 254 กิโลกรัม" +
          "จากนั้นจึงได้เอาเงินมาแลกเป็นทองคำจำนวน 30 กิโลกรัม แล้วแผ่เป็นแผ่นทึบหุ้มองค์พระธาตุเจดีย์หลวง เมื่อรวมกับทองคำที่หุ้มองค์พระเจดีย์หลวงอยู่เดิม ได้น้ำหนักทองคำถึง 2,382.517 กิโลกรัม" +
          "แต่เดิมวัดเจดีย์หลวง ชื่อ “โชติการามวิหาร” แปลว่า พระอารามที่มีแต่ความรุ่งเรืองสว่างไสว เนองจากเปนสถานทบรรจพระเกศาธาต และพระธาตขององคสมเดจพระสมมาสมพุทธเจ้า" +
          "มีเรื่องเล่าต่อกันมาว่าในกาลครั้งหนึ่งเมื่อพระเจ้าอโศกมหาราชสงสมณะทต 8 รป ภายใตการนำพระโสณะ และ พระอตตะระ เขามาเผยแพรพระพทธศาสนาในเขตสวรรณภม รวมทงภมภาคนดวย" +
          "ได้นำเอาพระบรมธาตมาบรรจไวในองคเจดยองคเลกสง 3 ศอก ทสรางขน ณ บรเวณอนเปนทตงของพระธาตเจดยหลวงในปจจบน ในเวลานนมชายผหนงอาย 120 ป มใจเลอมใส ไดแกเอาผาหมชบนำมนจดบชา" +
          "และไดทำนายวา ตอไปในภายภาคหนาตรงนจะเปนอารามใหญชอโชตการาม พวกลวะทงหลายเอาขาวของบชาพระธาตพระพทธเจา จงกอเจดยหลงหนงสง 3 ศอกไวเปนทสกการบชา",
      "clock":
          "เวลาเปิด-ปิด: 08:00-17:00 เวลาทำการ: ทุกวัน โทรศัพท์: 053-814-308",
      "location":
          "สถานที่ตั้ง: ถนนพระปกเกล้า ตำบลพระสิงห์ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50200",
      "lat": "18.7871114884228",
      "lnt": "98.98675205794059"
    },
    {
      "name": "วัดพระธาตุดอยสุเทพ",
      "picture1": "assets/images/travelA/A1_theplace_1.jpg",
      "picture2": "assets/images/travelA/A1_theplace_2.png",
      "picture3": "assets/images/travelA/A1_theplace_3.png",
      "picture4": "assets/images/travelA/A1_theplace_4.png",
      "picture5": "assets/images/travelA/A1_theplace_5.png",
      "data": 
          "วัดพระธาตุดอยสุเทพราชวรวิหาร (คำเมือง: LN-Wat Phra That Doi Suthep.png) พระอารามหลวง ชั้นโท ชนิดราชวรวิหาร ตั้งอยู่ในอุทยานแห่งชาติดอยสุเทพ-ปุย" +
          "วัดมีความสูงจากระดับที่ราบเชียงใหม่ราว 689 เมตร และมีความสูงจากระดับน้ำทะเลปานกลาง 1,046 เมตร เป็นหนึ่งในวัดที่มีความสำคัญมากที่สุดของจังหวัดเชียงใหม่ ก่อสร้างตามแบบศิลปะล้านนา" +
          "มีเจดีย์ทรงเชียงแสน ฐานสูงย่อมุมระฆังทรงแปดเหลี่ยมปิดด้วยทองจังโก 2 ชั้น ลานเจดีย์เป็นจุดชมทิวทัศน์เมืองเชียงใหม่ ทางขึ้นเป็นบันไดนาคเจ็ดเศียรก่อปูน เจ้าอาวาสรูปปัจจุบันคือพระธรรมเสนาบดี (ธงชัย สุวณฺณสิริ)" +
          "วัดพระธาตุดอยสุเทพ สร้างขึ้นเมื่อปี พ.ศ. 1927 (จ.ศ. 746) ในสมัยพญากือนา กษัตริย์องค์ที่ 6 แห่งอาณาจักรล้านนา ราชวงศ์มังราย พระองค์ทรงได้อัญเชิญพระบรมสารีริกธาตุองค์ใหญ่" +
          "ที่ได้ทรงเก็บไว้สักการบูชาส่วนพระองค์ถึง 13 ปี มาบรรจุไว้ที่นี่ ด้วยการทรงอธิษฐานเสี่ยงช้างมงคลเพื่อเสี่ยงทายสถานที่ประดิษฐาน พอช้างมงคลเดินมาถึงยอดดอยสุเทพ มันก็ร้องสามครั้ง" +
          "พร้อมกับทำประทักษิณสามรอบ แล้วล้มลง พระองค์จึงโปรดเกล้าฯให้ขุดดินลึก 8 ศอก กว้าง 6 วา 3 ศอก หาแท่นหินใหญ่ 6 แท่น มาวางเป็นรูปหีบใหญ่ในหลุม แล้วอัญเชิญพระบรมสารีริกธาตุลงประดิษฐานไว้" +
          "จากนั้นถมด้วยหิน แล้วก่อพระเจดีย์สูง 5 วา ครอบบนนั้น ด้วยเหตุนี้จึงห้ามพุทธศาสนิกชนที่ไปนมัสการสวมรองเท้าในบริเวณพระธาตุ และมิให้สตรีเข้าไปบริเวณนั้น ",
      "clock":
          "เวลาเปิด-ปิด: 05:00-20:00 เวลาทำการ: ทุกวัน โทรศัพท์: 053-295-002",
      "location":
          "สถานที่ตั้ง: 9หมู่9 ถนน.ศรีวิชัย ต.สุเทพ อ.เมืองเชียงใหม่ จ.เชียงใหม่ 50200",
      "lat": "18.805019355671494",
      "lnt": "98.92158005239567"
    },
    {
      "name": "วัดพระธาตุดอยคำ",
      "picture1": "assets/images/travelA/A2_theplace_1.jpeg",
      "picture2": "assets/images/travelA/A2_theplace_2.png",
      "picture3": "assets/images/travelA/A2_theplace_3.jpg",
      "picture4": "assets/images/travelA/A2_theplace_4.jpg",
      "picture5": "assets/images/travelA/A2_theplace_5.jpg",
      "data": 
          "วัดพระธาตุดอยคำ เป็นวัดสำคัญในจังหวัดเชียงใหม่ อายุเก่าแก่กว่า 1,300 ปี ตั้งอยู่บริเวณดอยคำ ด้านหลังอุทยานหลวงราชพฤกษ์ ห่างจากตัวเมืองประมาณ 10 กิโลเมตร วัดพระธาตุดอยคำมีความสูงจากระดับที่ราบเชียงใหม่ราว 140 เมตร" +
          "และมีความสูงจากระดับน้ำทะเลปานกลาง 465 เมตร วัดพระธาตุดอยคำมีลานชมวิวที่สามารถมองเห็นวิวทิวทัศน์รอบเมืองเชียงใหม่ และยังเป็นที่ประดิษฐานพระเจ้าทันใจซึ่งมีอายุเก่าแก่กว่าห้าร้อยปี วัดพระธาตุดอยคำสร้างในปี พ.ศ. 1230 " +
          "รัชสมัยพระนางจามเทวีกษัตริย์แห่งหริภุญชัย โดยพระโอรสทั้ง 2 เป็นผู้สร้าง ประกอบด้วยเจดีย์บรรจุพระบรมสารีริกธาตุของพระพุทธเจ้า ศาลาการเปรียญกุฏิสงฆ์ และพระพุทธรูปปูนปั้น เดิมชื่อวัดสุวรรณบรรพต แต่ชาวบ้านเรียกว่า"+"วัดดอยคำ" +
          "พ.ศ. 2509 ขณะนั้นวัดดอยคำเป็นวัดร้าง ต่อมากรุแตกชาวบ้านพบโบราณวัตถุหลายชิ้น เช่น พระรอดหลวง พระหินทรายปิดทององค์ใหญ่ พระสามหมอ (เนื้อดิน) ซึ่งนำมาประดิษฐานไว้ ณ วัดพระธาตุดอยคำ พระธาตุดอยคำนอกจากจะเป็นที่สักการบูชาของคนท้องถิ่นแล้ว" +
          "ยังเป็นสัญลักษณ์อีกแห่งหนึ่งของการบินไทยที่ใช้กำหนดพื้นที่ทางสายตา ก่อนที่จะนำเครื่องบินลงจอดที่สนามบินเชียงใหม่ ประจำทุกปี โดยยึดถือเอาวันแรม 7 ค่ำ 8 ค่ำ หลังวันวิสาขบูชาทุกปี เป็นวันสรงน้ำพระธาตุ ซึ่งถือว่าเป็นวันถวายพระเพลิงพระพุทธศรีระของ" +
          "สมเด็จพระสัมมาสัมพุทธเจ้า (หลังเสด็จดับขันธปรินิพพานได้ 8 วัน) ถือเป็นวันสำคัญในพระพุทธศาสนาวันหนึ่ง ตรงกับวันแรม 8 ค่ำ เดือนวิสาขะ (เดือน 6 ของไทย) ทางวัดพระธาตุดอยคำ จึงยึดถือเอาวันนี้จัดงาน และพิธีสรงน้ำเพื่อรำลึกนึกถึง พุทธคุณ ธรรมคุณ สังฆคุณ" +
          "ที่ท่านได้สร้างเผยแพร่พระพุทธศาสนาเอาไว้",
      "clock":
          "เวลาเปิด-ปิด: 06:00-18:00 เวลาทำการ: ทุกวัน โทรศัพท์: 053-263-001, 053-248-604",
      "location": "สถานที่ตั้ง: 108หมู่3 ต.แม่เหียะ อ.เมือง จ.เชียงใหม่ 50100",
      "lat": "18.75970952374555",
      "lnt": "98.91866929657218"
    },
    {
      "name": "วัดพระสิงห์",
      "picture1": "assets/images/travelA/A4_theplace_1.jpg",
      "picture2": "assets/images/travelA/A4_theplace_2.jpg",
      "picture3": "assets/images/travelA/A4_theplace_3.png",
      "picture4": "assets/images/travelA/A4_theplace_4.png",
      "picture5": "assets/images/travelA/A4_theplace_5.png",
      "data": 
          "พญาผายู กษัตริย์เชียงใหม่ราชวงศ์มังราย โปรดเกล้าฯ ให้สร้างขึ้นในปี พ.ศ. 1888 ขั้นแรกให้ก่อสร้างเจดีย์สูง 23 วา เพื่อบรรจุพระอัฐิของพญาคำฟู พระราชบิดา ต่อมาอีก 2 ปี จึงได้สร้างพระอาราม เสนาสนวิหาร ศาลาการเปรียญ หอไตร และกุฏิสงฆ์ เมื่อเสร็จเรียบร้อย" +
          "ทรงตั้งชื่อว่า" + "วัดลีเชียงพระ" + "สมัยพญาแสนเมืองมาขึ้นครองเวียงเชียงใหม่ โปรดให้อัญเชิญพระพุทธสิหิงค์มาจากเมืองเชียงราย มาประดิษฐานในวันที่ 23 พฤศจิกายน พ.ศ. 2483 วัดพระสิงห์ได้รับพระกรุณาโปรดให้ยกเป็นพระอารามหลวงชั้นเอก ชนิดวรมหาวิหาร",
      "clock":
          "เวลาเปิด-ปิด: 9:00-18:00น. เวลาทำการ: ทุกวัน โทรศัพท์: 053-416-027",
      "location":
          "สถานที่ตั้ง: ถนนสามล้าน ตำบลพระสิงห์ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่",
      "lat": "18.788610668210964",
      "lnt": "98.98200177064842"
    },
    {
      "name": "วัดศรีสุพรรณ",
      "picture1": "assets/images/travelA/A5_theplace_1.jpg",
      "picture2": "assets/images/travelA/A5_theplace_2.jpg",
      "picture3": "assets/images/travelA/A5_theplace_3.png",
      "picture4": "assets/images/travelA/A5_theplace_4.png",
      "picture5": "assets/images/travelA/A5_theplace_5.png",
      "data": 
          "เป็นวัดที่มีประวัติการก่อสร้างมาตั้งแต่ครั้งอดีตกว่า 500 ปี ในรัชสมัยของพระเจ้าเมืองแก้ว กษัตริย์เชียงใหม่ราชธานี และพระนางสิริยสวดี พระราชมารดามหาเทวีเจ้า โปรดเกล้าฯ ให้มหาอำมาตย์ชื่อเจ้าหมื่นหลวงจ่าคำ สร้างวัดชื่อว่า “วัดศรีสุพรรณอาราม” ต่อมาเรียกสั้น ๆ " +
          "ว่า “วัดศรีสุพรรณ” ภายในวัดมีอุโบสถเงินแห่งแรกของโลก ที่ชาวชุมชนร่วมแรงร่วมใจสืบสานเครื่องเงินชุมชนวัวลาย ซึ่งเป็นชุมชนทำหัตถกรรมเครื่องเงินที่มีชื่อเสียงของจังหวัดเชียงใหม่เนื่องด้วยวัดศรีสุพรรณตั้งอยู่ท่ามกลางชุมชนหัตถกรรมช่างหล่อ หัตถกรรมเครื่องเงิน" +
          "เครื่องเขิน ของถนนวัวลาย ทางวัดจึงมีแนวคิดที่จะสืบสานมรดกงานศิลป์ภูมิปัญญาท้องถิ่นให้ยั่งยืนสืบไปด้วยการรวบรวมภูมิปัญญาชาวบ้านจัดตั้งเป็น กลุ่มหัตถศิลป์ลานนาวดศรสพรรณ มการจดตงศนยศกษาศลปะไทยโบราณ สลาสบหมลานนาวดศรสพรรณ ขนภายในวด" +
          "ในป พ.ศ. 2547 ทางวดศรสพรรณมแนวคดสรางอโบสถเงนหลงแรกของโลก ใหเปนสถาปตยกรรมสำคญทางพระพทธศาสนา โดยมปณธานรวมกนเพอ “ฝากศลปแกแผนดนลานนา ถวายไวในบวรพระพทธศาสนา เทดไทองคราชนย รชกาล ท 9” " +
          "เกิดเปนพทธศลปอนวจตรทดงดดใหทงพทธศาสนกชนและบนกทองเทยวทงชาวไทยและตางประเทศมาเยยมชมความงดงามของพระอโบสถหลงนอยทกวน",
      "clock":
          "เวลาเปิด-ปิด: 6:00–18:00 เวลาทำการ: ทุกวัน โทรศัพท์: 053-274-705",
      "location":
          "สถานที่ตั้ง: ตั้งอยู่บนถนนวัวลาย ตำบลหายยา อำเภอเมือง จังหวัดเชียงใหม่ 50100",
      "lat": "18.778965141645426",
      "lnt": "98.98364681006606"
    },
    {
      "name": "วัดสวนดอก",
      "picture1": "assets/images/travelA/A6_theplace_1.jpg",
      "picture2": "assets/images/travelA/A6_theplace_2.jpg",
      "picture3": "assets/images/travelA/A6_theplace_3.png",
      "picture4": "assets/images/travelA/A6_theplace_4.png",
      "picture5": "assets/images/travelA/A6_theplace_5.png",
      "data": 
          "วัดสวนดอกสร้างขึ้นในภายในเวียงสวนดอก ซึ่งเป็นเขตพระราชอุทยานในสมัยราชวงศ์มังราย โดยในปี พ.ศ. 1914 (ศักราชนี้ถือตามหนังสือชินกาลมาลีปกรณ์ของพระรัตนปัญญาเถระ) พญากือนา กษัตริย์องค์ที่ 6 แห่ง ราชวงศ์มังราย ทรงพระกรุณาโปรดเกล้าฯ ให้สร้างเป็นพระอารามหลวง" +
          "เพื่อให้เป็นที่จำพรรษาของพระสุมนเถระ ผู้ประดิษฐานพระพุทธศาสนาลัทธิลังกาวงศ์ ในแผ่นดินล้านนา และสร้างองค์พระเจดีย์เพื่อประดิษฐานพระบรมสารีริกธาตุ 1 ใน 2 องค์ ที่พระสุมนเถระอัญเชิญมาจากสุโขทัย ในปี พ.ศ. 1912 (องค์หนึ่งประดิษฐานอยู่ในพระเจดีย์ในวัดพระธาตุดอยสุเทพราชวรวิหาร)" +
          "ในสมัยราชวงศ์มังราย วัดสวนดอกเจริญรุ่งเรืองมาก แต่หลังจากสิ้นราชวงศ์มังราย บ้านเมืองตกอยู่ในอำนาจพม่า ทั้งเกิดจลาจลวุ่นวาย วัดนี้จึงกลายสภาพเป็นวัดร้างไป จนได้รับการบูรณปฏิสังขรณ์ขึ้นใหม่อีกครั้ง ในรัชสมัยพระเจ้ากาวิละแห่งราชวงศ์ทิพย์จักร และได้รับการทำนุบำรุงจากเจ้านายฝ่ายเหนือ" +
          "และประชาชนเชียงใหม่มาโดยตลอด วัดสวนดอก ไดรบการบรณะครงสำคญ 2 ครง ครงแรกในป พ.ศ. 2450 เจาดารารศม พระราชชายาในพระบาทสมเดจพระจลจอมเกลาเจาอยหว ทรงพระกรณาโปรดเกลาฯ ใหอญเชญรวบรวมพระอฐ เจานครเชยงใหมและพระประยรญาตมาประดษฐานรวมกน" +
          "และตอมาอกครงหนงในป พ.ศ. 2475 เป็นการบรณปฏสงขรณองคพระวหารโดยครบาศรวชย นกบญแหงลานนา",
      "clock":
          "เวลาเปิด-ปิด: 8:00 - 17:00 เวลาทำการ: ทุกวัน โทรศัพท์: 053-278-304",
      "location":
          "สถานที่ตั้ง: ถนนสุเทพ ตำบลสุเทพ อำเภอเมือง จังหวัดเชียงใหม่ 50200",
      "lat": "18.78829963016687",
      "lnt": "98.96779408307924"
    }
  ];
  @override
  Widget build(BuildContext context) {
    return GridView.builder(
        itemCount: theplace_list.length,
        // itemCount: dataList.length,
        gridDelegate:
            SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 2),
        itemBuilder: (BuildContext context, int index) {
          return Single_theP(
              theP_name: theplace_list[index]['name'],
              theP_picture1: theplace_list[index]['picture1'],
              theP_picture2: theplace_list[index]['picture2'],
              theP_picture3: theplace_list[index]['picture3'],
              theP_picture4: theplace_list[index]['picture4'],
              theP_picture5: theplace_list[index]['picture5'],
              theP_data: theplace_list[index]['data'],
              theP_clock: theplace_list[index]['clock'],
              theP_location: theplace_list[index]['location'],
              theP_lat: theplace_list[index]['lat'],
              theP_lnt: theplace_list[index]['lnt'],);
        });
  }
}

class Single_theP extends StatelessWidget {
  final theP_name;
  final theP_picture1;
  final theP_picture2;
  final theP_picture3;
  final theP_picture4;
  final theP_picture5;
  final theP_data;
  final theP_clock;
  final theP_location;
  final theP_lat;
  final  theP_lnt;

  Single_theP({
    this.theP_name,
    this.theP_picture1,
    this.theP_picture2,
    this.theP_picture3,
    this.theP_picture4,
    this.theP_picture5,
    this.theP_data,
    this.theP_clock,
    this.theP_location,
    this.theP_lat,
    this.theP_lnt,
  });
  @override
  Widget build(BuildContext context) {
    return Card(
      child: Hero(
          tag: theP_name,
          child: Material(
            child: InkWell(
              onTap: () => Navigator.of(context).push(MaterialPageRoute(
                  builder: (context) => TheplaceTravelA(
                      theP_T_name: theP_name,
                      theP_T_picture1: theP_picture1,
                      theP_T_picture2: theP_picture2,
                      theP_T_picture3: theP_picture3,
                      theP_T_picture4: theP_picture4,
                      theP_T_picture5: theP_picture5,
                      theP_T_data: theP_data,
                      theP_T_clock: theP_clock,
                      theP_T_location: theP_location,
                      theP_T_lat: theP_lat,
                      theP_T_lnt: theP_lnt))),
              child: GridTile(
                  footer: Container(
                    color: Colors.white70,
                    child: ListTile(
                      leading: Text(
                        theP_name,
                        style: TextStyle(
                            fontFamily: 'Sriracha',
                            fontSize: 17,
                            color: Colors.teal[900]),
                      ),
                    ),
                  ),
                  child: Image.asset(
                    theP_picture1,
                    fit: BoxFit.cover,
                  )),
            ),
          )),
    );
  }
}
